{"data":{"site":{"siteMetadata":{"title":"Katarina's Blog","author":"Katarina Kala"}},"markdownRemark":{"id":"c71b4aa1-9fc8-5307-b809-5b3b1f3c484d","html":"<p>Eelmise nädala kolmapäeval käisin Mektorys kuulamas põnevat konverentsi, kus paljud spetsialistid käisid tutvustamas erinevaid IT-valdkonna ameteid. Konverents oli minu jaoks väga huvitav, sest õpin ju ise IT-d, kuid pole kõikide IT-ametitega kursis.</p>\n<p>Kohal olid oma ala parimad mitmetest Eesti tuntud IT-firmadest (nt Helmesest, Piperdrive’ist, Transferwise’ist ja Nortalist) ning seal räägiti järgmistest ametitest: Senior QA Specialist, ML consultant, CEO, Scrum master, Monitooring insener, Engineering lead, Analüütik, UX/UI designer, Space business manager.<br>\nLisaks tuli üllatusesinejana rääkima ka IT-teaduskonna aasta õppejõud Ago Luberg.</p>\n<p>Kahjuks ma kõiki esinejaid ei kuulnud, sest konverents algas juba kell kaks, kuid mul oli veel tund aega majandusõpetus. Oleksin väga tahtnud kuulda ka Aare Nurme (Senior Q&#x26;A Specialist) ja Joonatan Samueli (ML consultant) esitlusi, sest tean nendest ametitest üpriski vähe. Õnneks kuulsin ma palju huvitavat teistest ametitest :)</p>\n<p>Minu jaoks kõige huvitavam oli teada saada, kes on Scrum master. Alguses kõlas see ametinimi minu jaoks väga uhkelt ning ma arvasin, et tegu on umbes nagu projektijuhiga, kuid kohe esitluse alguses ütles Scrum master, et tema ei ole projektijuht, vaid ta pigem suunab ja aitab oma tiimikaaslasi. Tema põhilisteks ülesanneteks on:<br>\n1. Aidata oma tiimikaaslastel paika panna eesmärgid ja ülesanded, mis peavad teatud aja jooksul tehtud olema.<br>\n2. Aidata oma tiimil olla võimalikult produktiivsed.<br>\n3. Otsida oma tiimikaaslastele koolitusi, et nad saaksid rohkem areneda.<br>\n4. Probleemide ilmnemisel aidata neile lahendus leida. <br>\n5. Kaitsta oma tiimikaaslasi teiste eest.</p>\n<p>Lisaks oli põnev teada saada, mida teeb UX/UI designer ning mis vahe on User Experience’il ja User Interface’il. Selle ilmestamiseks leidsin ma ka hea pildi:</p>\n<p><img src=\"http://52.28.251.54/wp-content/uploads/2018/11/Screenshot-2018-11-25-at-20.44.02.png\"></p>\n<p>UX ja UI disaini erinevus.</p>\n<p>Lühidalt öeldes on UX raamistiku tegemine ning UI on selle kujundamine. UX keskendub sellele, et inimene tunneks ennast veebileheküljel mugavalt ehk kõik nupud jms oleksid loogilisel ja mugaval kohal. UI keskendub sellele, et lehekülg näeks ilus ja atraktiivne välja.</p>\n<p>Põnev oli kuulda ka, kuidas käib töö kosmosetööstuses ning mida teeb seal arendaja. Meeldejääv oli ka analüütiku esitlus, kes alustas seda küsimusega: “Kelleks te lapsena saada tahtsite?“. Kõlas vastuseid nagu “arstiks”, “advokaadiks”, “õpetajaks” ning seejärel vastas analüütik, et ta ka ise mõtles noorena sellistele ametitele ja, et ta ei ole kunagi kuulnud, et ükski laps tahaks saada analüütikuks.</p>\n<p>Viimase esinejana tuli rääkima Ago Luberg, kes on hetkel ka minu programmeerimise aine õppejõuks. Ta vastas küsimustele nagu “Kas IT-d õppida on õige valik?”, “Mida IT-alane tulevik endast kujutab?” ja “Mis on IT-valdkonnas töötamise ohud?“. Lisaks sellele tegi ta kaks Kahooti ja mängis muusikat programmeerides.</p>\n<p>Konverents oli minu arvates väga huvitav ja teadmisterohke. Mina sain kindlasti palju uut infot erinevate ametite kohta ning põnev oli kuulda erinevate spetsialistide edulugusid ning kogemusi.</p>","timeToRead":2,"frontmatter":{"title":"IT- ametite päev","date":"November 25, 2018","spoiler":"IT- ametite päev"},"fields":{"slug":"/it-ametite-paev/","langKey":"en"}}},"pageContext":{"slug":"/it-ametite-paev/","previous":{"fields":{"slug":"/vahepealne-kokkuvote/","langKey":"en","directoryName":"vahepealne-kokkuvote"},"frontmatter":{"title":"Vahepealne kokkuvõte"}},"next":{"fields":{"slug":"/eesti-idufirmad/","langKey":"en","directoryName":"eesti-idufirmad"},"frontmatter":{"title":"Eesti idufirmad"}},"translations":[],"translatedLinks":[]}}