{"data":{"site":{"siteMetadata":{"title":"Katarina's Blog","author":"Katarina Kala"}},"markdownRemark":{"id":"0f57c3be-9ce8-5a23-8283-1eb89dee93d3","html":"<p>Alustasin uue programmeerimiskeele- C# õppimisega ning mõtlesin kirjutada mõned olulised asjad, mida seni olen õppinud ning millele tähelepanu pöörata.</p>\n<ul>\n<li>C# on <em>keysensitive</em> ehk tuleb olla väga tähelepanelik suure ja väikese algustähega.</li>\n<li>Vigade korral aitab Visul Studios punane loogeline joon, mis tuleb vigasele kohale alla ning sa saad selle ära parandada.</li>\n<li>C# keelt on lihtne ära tunda kahe märgi poolest: loogelised sulud {} ja semikoolon ;. Loogelisi sulge esineb koodis palju ning semikoolon on iga rea lõpus (v.a kui defineerime klassi või meetodit).</li>\n<li>Kui soovid ühte rida välja kommenteerida (nt teha endale märkmeid, kirjutada kommentaar), siis kirjuta rea algusesse //</li>\n<li>Kui soovid mitut rida välja kommenteerida, kirjuta /* <em>tekst mida soovid välja kommenteerida</em> */</li>\n</ul>\n<p>Järgnevalt on näha koodi, mida ükskõik millises programmeerimiskeeles esimesena kirjutatakse ehk “Hello World!” kirjutamine:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">x = 7;\ny = x + 3;\nConsole.WriteLine(y);</code></pre></div>\n<p>Pildil on ka lühidalt seletatud, mis asjad on klass ja meetod.</p>\n<p>Koodis on olulised asjad ka muutujad, mida näeme järgneval pildil:</p>\n<p><img src=\"http://52.28.251.54/wp-content/uploads/2019/05/image-1.png\"></p>\n<p>Pildil on muutujateks x ja y, millele me oleme andnud mingid väärtused. Kui koodi käivitame saame vastuseks 10, sest kui liidame x (mis on 7) ning 3, saame tulemuseks 10.</p>\n<p>NB! Väga oluline on panna muutujatele head nimed, et sina ja teised saaksid hästi aru, mida need tähistavad. Ülal pildil oleme teinud lihtsa arvutuse, kuid kui hiljem kirjutame keerulisemat koodi, on hästi näha, kui oluline on panna muutujatele head nimed.</p>\n<p>Oluline on ka osata muutujate nimesid õigesti kirjutada. See tähendab, et kui soovid kirjutada muutujale nime, mis koosneb näiteks kahest sõnast, siis need kirjutatakse kokku ja _camelcase’_is ehk teise sõna esimene täht on suur ning kõik teised tähed on väikesed. Näiteks ülemisel pildil oleva muutuja x võime asendada nimega numberSeven.</p>","timeToRead":1,"frontmatter":{"title":"Uue keele õpingud","date":"May 02, 2019","spoiler":"Uue keele õpingud"},"fields":{"slug":"/uue-keele-opingud/","langKey":"en"}}},"pageContext":{"slug":"/uue-keele-opingud/","previous":{"fields":{"slug":"/sotsiaalmeedia-moju-majandusele/","langKey":"en","directoryName":"sotsiaalmeedia-moju-majandusele"},"frontmatter":{"title":"Sotsiaalmeedia mõju majandusele"}},"next":null,"translations":[],"translatedLinks":[]}}