{"data":{"site":{"siteMetadata":{"title":"Katarina's Blog","author":"Katarina Kala"}},"markdownRemark":{"id":"87a23b6a-73a2-5947-9b24-c6fb0ba69117","html":"<p>Nagu eelmises postituses mainisin, siis tegin aines IT eetilised, sotsiaalsed ja professionaalsed aspektid esitluse teemal Eesti idufirmad, millest mõtlesin ka Teile natuke pikemalt kirjutada. Rääkisin neljast Eesti tuntud <em>start-up</em>ist, milleks olid Transferwise, Taxify, Pipedrive ja Starship Technologies. Kirjutan iga ettevõtte kohta mõned põnevad faktid, mis nende kohta teada sain ning äkki leiate ka Teie midagi uut ja põnevat nende <em>start-up</em>ide kohta :).</p>\n<p><strong>Transferwise:</strong></p>\n<ul>\n<li>Tegemist on rahaülekandeteenusega, mille eesmärk on muuta valuutamaksed odavamaks ja kiiremaks.</li>\n<li>Tänaseks on nad muutnud maksed kuni 8x odavamaks, seda seetõttu et nad lisavad turu keskmisele kursile madalama omatasu, kui seda teeb pank.</li>\n<li>Neil on üle nelja miljoni kasutaja ja nende süsteemis on rohkem kui 47 erinevat valuutat.</li>\n<li>Iga kuu liigub Transferiwise’i kaudu üle kolme miljardi euro väärtuses raha erinevate riikide vahel. </li>\n</ul>\n<p><strong>Taxify:</strong></p>\n<ul>\n<li>Markus Villig oli <em>start-up</em>i asutamise ajal vaid 19-aastane.</li>\n<li>Algselt kandis firma nime mTakso.</li>\n<li>Taxifyd saab kasutada 25 erinevas riigis, mis asuvad Euroopas, Aafrikas, Kesk-Ameerikas ja Lähis-Idas.</li>\n<li>Taxifyl on üle 10 miljoni kasutaja.</li>\n<li>Alates kevadest võib Taxify kohta öelda ka ükssarvik, sest firma väärtuseks hinnatakse olevat üle miljardi dollari.</li>\n<li>Selle aasta sügisel avas Taxify koos Olerexiga Veerennis tankla, kus Taxify taksojuhid saavad soodsamalt tankida.</li>\n</ul>\n<p><strong>Pipedrive:</strong></p>\n<ul>\n<li>Kandis algselt nime New Pipe Technologies.</li>\n<li>Ettevõte pakub müügitarkvaralahendust, mis aitab müügimeestel ja -tiimidel oma müügiprotsesse hallata.</li>\n<li>Aastal 2016 valiti Pipedrive parimaks tööandjaks Eestis. </li>\n<li>Neil on üle 75 000 kasutaja 170 erinevas riigis.</li>\n<li>Nende klientide hulka kuuluvad ka näiteks Vimeo ja SkyScanner.</li>\n</ul>\n<p><strong>Starship Technologies:</strong></p>\n<ul>\n<li>Ettevõte toodab isesõitvaid pakiroboteid.</li>\n<li><em>Start-up</em>i loojateks on Janus Friis ja Ahti Heinla, kes olid ka Skype’i asutamisega seotud. </li>\n<li>Pakirobotid jaksavad kanda kuni 10 kilogrammiseid pakke 5 kilomeetri raadiuses. </li>\n<li>Robotitel hoiavad pidevalt silma peal ka operaatorid, kes vajaduse korral juhivad robotit ise.</li>\n<li>Aastast 2017 võib pakiroboteid näha ka USAs ja Saksamaal (Hamburgis) toitu laiali viimas, kuid seal on vahemaad väiksemad (3 km ja 1,6km).</li>\n</ul>\n<p>Tagantjärele mõeldes oleks äkki oma esitluses võinud rääkida vähemtuntud <em>start-up</em>idest, kuid mis tehtud, see tehtud :) Vähemalt sain endale esitlust tehes uusi teadmisi valitud ettevõtete kohta ning loodan, et ka Sina leidsid endale siit midagi uut ja huvitavat :)</p>","timeToRead":2,"frontmatter":{"title":"Eesti idufirmad","date":"December 04, 2018","spoiler":"Nagu eelmises postituses mainisin"},"fields":{"slug":"/eesti-idufirmad/","langKey":"en"}}},"pageContext":{"slug":"/eesti-idufirmad/","previous":{"fields":{"slug":"/it-ametite-paev/","langKey":"en","directoryName":"it-ametite-paev"},"frontmatter":{"title":"IT- ametite päev"}},"next":{"fields":{"slug":"/sotsiaalmeedia-moju-majandusele/","langKey":"en","directoryName":"sotsiaalmeedia-moju-majandusele"},"frontmatter":{"title":"Sotsiaalmeedia mõju majandusele"}},"translations":[],"translatedLinks":[]}}