{"data":{"site":{"siteMetadata":{"title":"Katarina's Blog","author":"Katarina Kala"}},"markdownRemark":{"id":"495d46fd-16cf-577e-bc86-89f15a5ac671","html":"<p>Kirjutasin majanduses essee sama pealkirjaga nagu on sellel postitusel. Leidsin nii positiivseid kui ka negatiivseid külgi, mida jagaksin hea meelega ka Teiega. Alustuseks üks huvitav fakt - maailmas elab täna 7,5 miljardit inimest, kellest 42% on aktiivsed sotsiaalmeedia kasutajad ja see protsent suureneb iga aastaga.</p>\n<p><strong>Sotsiaalmeedia positiivsed küljed majandusele:</strong></p>\n<ul>\n<li>\n<p>Sotsiaalmeedia suurim pluss-pool majandusele on minu arvates klientideni lihtne jõudmine.  Kuna tänapäeval veedab keskmine inimene umbes kaks tundi sotsiaalmeedia võrgustikes ja teismelised lausa üheksa tundi, siis parim viis endale kliente leida, on teha mõnele sotsiaalmeedia leheküljele (nt Instagrami või Facebooki) konto ning reklaamida seal oma tooteid/teenuseid.  </p>\n</li>\n<li>\n<p>Tänu sotsiaalmeediale on tekkinud uued töökohad: digiturunduse spetsialist, <em>youtuber</em> ja <em>influencer.</em> Digiturunduse spetsialisti ülesandeks on kindlaks teha firma toodete või teenuste sihtgrupp ja tagada see, et õiged inimesed leiaksid läbi sotsiaalmeedia nende ettevõtte üles. Tänu sellele saab ettevõte rohkem kliente ja firma käive suureneb. Ametid nimega <em>youtuber</em> ja <em>influencer</em> on paljude noorte, eriti 13-16-aastaste ameeriklaste, unistuste töökohad. Nad teenivad raha selle eest, et teevad Youtube’i videosid, promovad tooteid ja teevad vahel avalikke esinemisi. Oluline on, et Youtube’i videod oleksid hästi tehtud ja, et nende sisu pakuks vaatajatele huvi. Lisaks peavad <em>youtuberid</em> ja <em>influencerid</em> oskama ennast hästi reklaamida, et ettevõtted paluksid neil tooteid promoda ning, et inimesed saaksid neist teadlikuks.</p>\n</li>\n<li>\n<p>Inimesed saavad tooteid osta ka tänu sotsiaalmeedias kuvatavatele reklaamidele. Kuna kõikidel sotsiaalmeediavõrgustikel on hea ülevaade sellest, mis inimestele meeldib tänu <em>like</em>’itud lehekülgedele, siis isik näeb just talle huvipakkuvaid reklaame ning ostab suurema tõenäosusega mõne reklaamitud toote. Paljud sotsiaalmeediavõrgustikud teenivad just tänu reklaamidele palju raha. Näiteks eelmisel aastal oli Facebookil käive 40 miljardit dollarit, millest 39,9 miljardit tuli tänu reklaamidele.</p>\n</li>\n</ul>\n<p><strong>Sotsiaalmeedia negatiivsed küljed majandusele:</strong></p>\n<ul>\n<li>Arvan, et negatiivseim aspekt sotsiaalmeedia puhul on see, et inimesed on sellest väga sõltuvad ning ei suuda tihti selle “mullist” välja tulla. Ameerika Psühholoogia Ühenduse (APA) uuringu kohaselt võib produktiivsus väheneda kuni 40%, kui vaadata vahepeal sotsiaalmeediat, sest tekib <em>task switching cost</em>. Tegemist ongi ajakuluga, mis tekib ühelt ülesandelt teisele lülitumisel ja APA uuringu kohaselt läheb ühelt ülesandelt teisele lülitumiseks keskmiselt aega 23 minutit ja 15 sekundit, mis on päris pikk aeg. Lisaks vähendab sotsiaalmeedia kasutamine keskendumisvõimet. Seega paljudele firmadele on sotsiaalmeedia ka kahjulik, sest ettevõtte töötajad ei ole nii produktiivsed ja keskendunud.</li>\n<li>Teine negatiivne aspekt sotsiaalmeedia puhul on see, et kõik võivad kirjutada, mida nad tahavad ehk inimesed saavad ettevõtte toodetele/teenustele kirjutada ka halbu kommentaare ja arvustusi, mida kõik teised inimesed näevad. Seetõttu võib mõnel inimesel firma toode ostmata jääda, sest keegi oli selle kohta negatiivse kommentaari kirjutanud. Mida rohkem firma negatiivseid kommentaare saab, seda vähem neilt ostetakse ning seda vähem firma teenib.</li>\n</ul>\n<p>Lisaks kirjutasin essees klikifarmidest. Tegemist on tasulise teenusega, mille pakkujal on sadu või isegi tuhandeid seadmeid, mille abil pannakse kliendi sotsiaalmeedia leheküljele <em>like</em> ja positiivseid kommentaare. Leidsin siia ka hea video klikifarmist, kus on näidatud Hiinas asuvat üle 10 000 seadmega klikifarmi: <a href=\"https://www.youtube.com/watch?v=NXvzhYnlTU0\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">https://www.youtube.com/watch?v=NXvzhYnlTU0</a></p>","timeToRead":2,"frontmatter":{"title":"Sotsiaalmeedia mõju majandusele","date":"December 11, 2018","spoiler":"Sotsiaalmeedia mõju majandusele"},"fields":{"slug":"/sotsiaalmeedia-moju-majandusele/","langKey":"en"}}},"pageContext":{"slug":"/sotsiaalmeedia-moju-majandusele/","previous":{"fields":{"slug":"/eesti-idufirmad/","langKey":"en","directoryName":"eesti-idufirmad"},"frontmatter":{"title":"Eesti idufirmad"}},"next":{"fields":{"slug":"/uue-keele-opingud/","langKey":"en","directoryName":"uue-keele-opingud"},"frontmatter":{"title":"Uue keele õpingud"}},"translations":[],"translatedLinks":[]}}